---
kind: enumMember
id: F:Autodesk.Revit.DB.SpacingRuleLayout.None
enum: Autodesk.Revit.DB.SpacingRuleLayout
source: html/163b0cc7-31f0-68b4-ced5-bea6d3c5abcc.htm
---
# Autodesk.Revit.DB.SpacingRuleLayout.None

No points or lines will be created.